In [1]:
require(readxl)
help(read_excel)

Loading required package: readxl

In [2]:
df <- read_excel("example_sheets2.xlsx")

In [59]:
install.packages('xlsx')

Installing package into 'C:/Users/erima96/Documents/R/win-library/3.6'
(as 'lib' is unspecified)
also installing the dependencies 'rJava', 'xlsxjars'

package 'rJava' successfully unpacked and MD5 sums checked
package 'xlsxjars' successfully unpacked and MD5 sums checked
package 'xlsx' successfully unpacked and MD5 sums checked

The downloaded binary packages are in
	C:\Users\erima96\AppData\Local\Temp\Rtmpm8jDJk\downloaded_packages

In [2]:
require(xlsx)
help(write.xlsx)

Loading required package: xlsx

In [8]:
require(xlsx)
cols <-  c(1, 2, 3)

df <- read.xlsx('MLBPlayerSalaries.xlsx', 
                   sheetName='MLBPlayerSalaries', colIndex=cols)
head(df)

  Year Player          Salary
1 1988 Mike Witt       1400000
2 1988 George Hendrick  989333
3 1988 Chili Davis      950000
4 1988 Brian Downing    900000
5 1988 Bob Boone        883000
6 1988 Johnny Ray       857000

In [8]:
help(read_excel)

In [16]:
df <- read_excel('MLBPlayerSalaries.xlsx', 
           range = cell_cols('A:C'))

head(df, 3)

  Year Player          Salary
1 1988 Mike Witt       1400000
2 1988 George Hendrick  989333
3 1988 Chili Davis      950000

In [21]:
df <- read_excel('SimData/example_sheets2.xlsx', 'Session2',
           na = '-99')

head(df, 6)

  Name     ID Mean Correct Session
1 Pete     1  31   14      2
2 Steve    2  32   15      2
3 Dave     3  29   14      2
4 Justine  4  28   12      2
5 Frederic 5  43    2      2
6 John     6  NA   NA      2

In [5]:
df <- read_excel('SimData/example_sheets.xlsx', 
                 sheet='Session1', skip = 2)

head(df, 4)

  Name    ID Mean Correct Session
1 Pete    1  32   15      1
2 Steve   2  31   14      1
3 Dave    3  30   15      1
4 Justine 4  31   13      1

In [7]:
df <- read.xlsx('SimData/example_sheets.xlsx', 
                   sheetName='Session1', startRow=3)
head(df)

  Name     ID Mean Correct Session
1 Pete     1  32   15      1
2 Steve    2  31   14      1
3 Dave     3  30   15      1
4 Justine  4  31   13      1
5 Frederic 5  45   14      1
6 John     6  NA   NA      1

In [13]:
xlsx_data <- "SimData/example_sheets2.xlsx"

excel_sheets(path = xl_data)

[1] "Session1" "Session2"

In [14]:
tab_names <- excel_sheets(path = xlsx_data)

excel_sheets <- lapply(tab_names, function(x) read_excel(path = xlsx_data, sheet = x))

str(excel_sheets)

List of 2
 $ :Classes 'tbl_df', 'tbl' and 'data.frame':	10 obs. of  5 variables:
  ..$ Name   : chr [1:10] "Pete" "Steve" "Dave" "Justine" ...
  ..$ ID     : num [1:10] 1 2 3 4 5 6 7 8 9 10
  ..$ Mean   : num [1:10] 32 31 30 31 45 99 29 35 37 33
  ..$ Correct: num [1:10] 15 14 15 13 14 99 11 14 14 14
  ..$ Session: num [1:10] 1 1 1 1 1 1 1 1 1 1
 $ :Classes 'tbl_df', 'tbl' and 'data.frame':	10 obs. of  5 variables:
  ..$ Name   : chr [1:10] "Pete" "Steve" "Dave" "Justine" ...
  ..$ ID     : num [1:10] 1 2 3 4 5 6 7 8 9 10
  ..$ Mean   : num [1:10] 31 32 29 28 43 -99 31 33 38 33
  ..$ Correct: num [1:10] 14 15 14 12 2 -99 11 13 15 14
  ..$ Session: num [1:10] 2 2 2 2 2 2 2 2 2 2

In [15]:
df <- do.call("rbind", excel_sheets)

head(df)

  Name     ID Mean Correct Session
1 Pete     1  32   15      1
2 Steve    2  31   14      1
3 Dave     3  30   15      1
4 Justine  4  31   13      1
5 Frederic 5  45   14      1
6 John     6  99   99      1

In [25]:
xlsx_files <- c("example_concat.xlsx",
               "example_concat1.xlsx",
               "example_concat3.xlsx")

dataframes <- lapply(xlsx_files, function(x) 
    read_excel(path = paste0("simData/", x)))

In [26]:
df <- do.call("rbind", dataframes)

tail(df)

  Name      ID Mean Correct Session
1 Eric      25 34   14      1
2 Sven      26 NA   NA      1
3 Jenny     27 31   11      1
4 Greta     28 44   14      1
5 Margareta 29 29   14      1
6 Marget    30 27   14      1

In [34]:
dplyr::bind_rows(dataframes)

   a Name        ID Mean Correct Session
1  1 Pete         1 31   14      1
2  1 Steve        2 32   15      1
3  1 Dave         3 29   14      1
4  1 Justine      4 28   12      1
5  1 Frederic     5 43    2      1
6  1 John         6 NA   NA      1
7  1 Josephine    7 31   11      1
8  1 Lee          8 33   13      1
9  1 Roman        9 38   15      1
10 1 Caroline    10 33   14      1
11 2 Rolf        11 29   15      1
12 2 Jonathan    12 32   14      1
13 2 Kevin       13 31   15      1
14 2 Mona        14 32   13      1
15 2 Malin       15 42   14      1
16 2 Johan       16 33   11      1
17 2 Jon         17 NA   NA      1
18 2 Christopher 18 35   14      1
19 2 Carol       19 36   14      1
20 2 Knut        20 33   14      1
21 3 Jonny       21 33   14      1
22 3 Conny       22 31   12      1
23 3 Stephan     23 33   13      1
24 3 Peter       24 34   15      1
25 3 Eric        25 34   14      1
26 3 Sven        26 NA   NA      1
27 3 Jenny       27 31   11      1
28 3 Greta       28 44   14      1
29 3 Margareta   29 29   14      1
30 3 Marget      30 27   14      1

In [43]:
help(read_excel)

In [42]:
Sys.glob('./simData/*.xlsx')

[1] "./simData/example_concat.xlsx"  "./simData/example_concat1.xlsx"
[3] "./simData/example_concat3.xlsx" "./simData/example_sheets.xlsx"
[5] "./simData/example_sheets2.xlsx"

In [53]:
df <- read_excel('SimData/example_sheets2.xlsx', 
                 col_types=c("text", "text", "numeric",
                            "numeric", "text"),
                   sheet='Session1')

str(df)

Classes 'tbl_df', 'tbl' and 'data.frame':	10 obs. of  5 variables:
 $ Name   : chr  "Pete" "Steve" "Dave" "Justine" ...
 $ ID     : chr  "1" "2" "3" "4" ...
 $ Mean   : num  32 31 30 31 45 99 29 35 37 33
 $ Correct: num  15 14 15 13 14 99 11 14 14 14
 $ Session: chr  "1" "1" "1" "1" ...

In [4]:
df <- data.frame("Age" = c(21, 22, 20, 19, 18, 23), "Names" = c("Andreas", "George", "Steve",
                           "Sarah", "Joanna", "Hanna"))


str(df)

'data.frame':	6 obs. of  2 variables:
 $ Age  : num  21 22 20 19 18 23
 $ Names: Factor w/ 6 levels "Andreas","George",..: 1 2 6 5 4 3

In [5]:
write.xlsx(df, 'names_ages.xlsx', 
           sheetName = "Sheet1")

In [8]:
write.xlsx(df, 'names_ages.xlsx', 
           sheetName = "Names and Ages",
          row.names=FALSE)

In [14]:
df1 <- data.frame('Names' = c('Andreas', 'George', 'Steve',
                           'Sarah', 'Joanna', 'Hanna'),
                   'Age' = c(21, 22, 20, 19, 18, 23))

df2 <- data.frame('Names' =  c('Pete', 'Jordan', 'Gustaf',
                           'Sophie', 'Sally', 'Simone'),
                   'Age' = c(22, 21, 19, 19, 29, 21))

df3 <- data.frame('Names' = c('Ulrich', 'Donald', 'Jon',
                           'Jessica', 'Elisabeth', 'Diana'),
                   'Age' = c(21, 21, 20, 19, 19, 22))

dfs <- list(df1, df2, df3)

In [61]:
wb <- createWorkbook(type="xlsx")

In [64]:
help(createWorkbook
    )

In [62]:
multiple_dataframe <- function(i){
    
    df = dfs[i]
    sheet_name = paste0("Sheet", i)
    sheet = createSheet(wb, sheet_name)
    
    addDataFrame(df, sheet=sheet, row.names=FALSE)
}

lapply(seq_along(dfs), function(x) multiple_dataframe(x))

[[1]]
$ref
[1] "Java-Object{org.cran.rexcel.RCellBlock@130f889}"

attr(,"class")
[1] "CellBlock"

[[2]]
$ref
[1] "Java-Object{org.cran.rexcel.RCellBlock@1188e820}"

attr(,"class")
[1] "CellBlock"

[[3]]
$ref
[1] "Java-Object{org.cran.rexcel.RCellBlock@2f490758}"

attr(,"class")
[1] "CellBlock"

In [63]:
saveWorkbook(wb, 'multiple_Sheets.xlsx')